Ran Plan for project: `fileflow-ecs-prod` dir: `terraform/ecs-service` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy.fileflow_ecr_access will be created
+ resource "aws_iam_role_policy" "fileflow_ecr_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-ecr-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # aws_iam_role_policy.fileflow_secrets_access will be created
+ resource "aws_iam_role_policy" "fileflow_secrets_access" {
      + id          = (known after apply)
      + name        = "fileflow-prod-secrets-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ap-northeast-2:646886795421:key/6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "fileflow-prod-ecs-execution-role"
    }

  # aws_security_group.download_scheduler will be created
+ resource "aws_security_group" "download_scheduler" {
      + arn                    = (known after apply)
      + description            = "Security group for fileflow download scheduler tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "fileflow-prod-scheduler-download-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-fileflow-prod-scheduler-download"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all               = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-fileflow-prod-scheduler-download"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.pipeline_scheduler will be created
+ resource "aws_security_group" "pipeline_scheduler" {
      + arn                    = (known after apply)
      + description            = "Security group for fileflow pipeline scheduler tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "fileflow-prod-scheduler-pipeline-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-fileflow-prod-scheduler-pipeline"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all               = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-fileflow-prod-scheduler-pipeline"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.upload_scheduler will be created
+ resource "aws_security_group" "upload_scheduler" {
      + arn                    = (known after apply)
      + description            = "Security group for fileflow upload scheduler tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "fileflow-prod-scheduler-upload-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-fileflow-prod-scheduler-upload"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all               = {
          + "Component"   = "security"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "sg-fileflow-prod-scheduler-upload"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.download_scheduler_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/fileflow-scheduler-download"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/fileflow-scheduler-download"
          + "Owner"         = "platform-team@example.com"
          + "Project"       = "fileflow"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "fileflow-scheduler-download"
          + "Team"          = "platform-team"
        }
      + tags_all          = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/fileflow-scheduler-download"
          + "Owner"         = "platform-team@example.com"
          + "Project"       = "fileflow"
          + "Repository"    = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "fileflow-scheduler-download"
          + "Team"          = "platform-team"
        }
    }

  # module.download_scheduler_service.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.download_scheduler_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.download_scheduler_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/fileflow-prod"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fileflow-scheduler-download"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for fileflow-scheduler-download"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-download"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for fileflow-scheduler-download"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-download"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }
    }

  # module.download_scheduler_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/fileflow-prod-ecs-execution-role"
      + family                   = "fileflow-scheduler-download"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for fileflow-scheduler-download"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-download"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for fileflow-scheduler-download"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-download"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/fileflow-prod-ecs-task-role"
      + track_latest             = false
    }

  # module.fileflow_alb.aws_lb_target_group.this["fileflow"] will be updated in-place
~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-prod-alb-fileflow/0282974f4dcfd0de"
        name                               = "fileflow-prod-alb-fileflow"
        tags                               = {
            "Component"   = "load-balancer"
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "Target group for fileflow-prod-alb - fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow-prod-alb-fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (18 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/actuator/health" -> "/health"
            # (8 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/fileflow-prod/fileflow"
        name                               = "fileflow"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:17" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fileflow_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow:4" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/fileflow" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "fileflow" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for fileflow"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "fileflow"
            "Owner"       = "platform-team@example.com"
            "Repository"  = "infrastructure"
            "Service"     = "fileflow"
        }
        # (12 unchanged attributes hidden)
    }

  # module.pipeline_scheduler_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/fileflow-scheduler-pipeline"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/fileflow-scheduler-pipeline"
          + "Owner"         = "platform-team@example.com"
          + "Project"       = "fileflow"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "fileflow-scheduler-pipeline"
          + "Team"          = "platform-team"
        }
      + tags_all          = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/fileflow-scheduler-pipeline"
          + "Owner"         = "platform-team@example.com"
          + "Project"       = "fileflow"
          + "Repository"    = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "fileflow-scheduler-pipeline"
          + "Team"          = "platform-team"
        }
    }

  # module.pipeline_scheduler_service.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.pipeline_scheduler_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.pipeline_scheduler_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/fileflow-prod"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fileflow-scheduler-pipeline"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for fileflow-scheduler-pipeline"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-pipeline"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for fileflow-scheduler-pipeline"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-pipeline"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }
    }

  # module.pipeline_scheduler_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/fileflow-prod-ecs-execution-role"
      + family                   = "fileflow-scheduler-pipeline"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for fileflow-scheduler-pipeline"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-pipeline"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for fileflow-scheduler-pipeline"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-pipeline"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/fileflow-prod-ecs-task-role"
      + track_latest             = false
    }

  # module.upload_scheduler_logs.aws_cloudwatch_log_group.this will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ap-northeast-2:646886795421:key/46ee44d3-866f-4029-b456-338f482eb1cb"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/fileflow-scheduler-upload"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/fileflow-scheduler-upload"
          + "Owner"         = "platform-team@example.com"
          + "Project"       = "fileflow"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "fileflow-scheduler-upload"
          + "Team"          = "platform-team"
        }
      + tags_all          = {
          + "CostCenter"    = "engineering"
          + "Environment"   = "prod"
          + "ExportToS3"    = "disabled"
          + "KMSEncrypted"  = "true"
          + "LangfuseSync"  = "disabled"
          + "LogType"       = "application"
          + "ManagedBy"     = "Terraform"
          + "Name"          = "/aws/ecs/fileflow-scheduler-upload"
          + "Owner"         = "platform-team@example.com"
          + "Project"       = "fileflow"
          + "Repository"    = "infrastructure"
          + "RetentionDays" = "30"
          + "SentrySync"    = "disabled"
          + "Service"       = "fileflow-scheduler-upload"
          + "Team"          = "platform-team"
        }
    }

  # module.upload_scheduler_service.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.upload_scheduler_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.upload_scheduler_service.aws_ecs_service.this will be created
+ resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:ap-northeast-2:646886795421:cluster/fileflow-prod"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "fileflow-scheduler-upload"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "SERVICE"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for fileflow-scheduler-upload"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-upload"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all                           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS service for fileflow-scheduler-upload"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-upload"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive value)
        }
    }

  # module.upload_scheduler_service.aws_ecs_task_definition.this will be created
+ resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/fileflow-prod-ecs-execution-role"
      + family                   = "fileflow-scheduler-upload"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for fileflow-scheduler-upload"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-upload"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + tags_all                 = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Description" = "ECS task definition for fileflow-scheduler-upload"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "fileflow-scheduler-upload"
          + "Owner"       = "platform-team@example.com"
          + "Repository"  = "infrastructure"
          + "Service"     = "fileflow"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/fileflow-prod-ecs-task-role"
      + track_latest             = false
    }

Plan: 15 to add, 2 to change, 1 to destroy.

Changes to Outputs:
+ download_scheduler_log_group_name    = "/aws/ecs/fileflow-scheduler-download"
+ download_scheduler_security_group_id = (known after apply)
+ download_scheduler_service_id        = (known after apply)
+ download_scheduler_service_name      = "fileflow-scheduler-download"
+ pipeline_scheduler_log_group_name    = "/aws/ecs/fileflow-scheduler-pipeline"
+ pipeline_scheduler_security_group_id = (known after apply)
+ pipeline_scheduler_service_id        = (known after apply)
+ pipeline_scheduler_service_name      = "fileflow-scheduler-pipeline"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p fileflow-ecs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FFileFlow%252Fterraform%252Fecs-service%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p fileflow-ecs-prod
  ```
Plan: 15 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```